blog/41.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-02 Fri 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 5.4 The Explicit-Control Evaluator</title>
<meta name="author" content="Giulio" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 5.4 The Explicit-Control Evaluator
<br />
<span class="subtitle">2025-05-02 Fri</span>
</h1>
<p>
Previously we have designed and simulated a stack-and-registers-based
machine to compute factorials, and one to compute fibonaccis.
</p>

<p>
Section 5.4 describes a machine for general purpose computing
(Cf. p. 566). It does so, by translating the metacircular evaluator
&#x2014; a Scheme program which evaluates Scheme expressions &#x2014; into the
controller of a machine with the appropriate data paths (registers and
operations).
</p>

<p>
The metacircular evaluator showed us the general structure of the
evaluation process in terms of <code>eval</code> and <code>apply</code>. The
explicit-control evaluator shows how to translate that in terms of
operations on registers and stacks.
</p>
<blockquote>
<p>
This [&#x2026;] fill[s] in the gap in our understanding of how Scheme
expressions are interpreted, by providing an explicit model for the
mechanisms of control in the evaluator. (p. 492)
</p>
</blockquote>

<p>
We can now see how ``a subexpression manages to return a value to the
expression that uses this value'' (p. 491) and why ``some recursive
procedures generate iterative processes (that is, are evaluated using
constant space) whereas other recursive procedures generate recursive
processes'' (p. 491) &#x2014; a distinction introduced in Chapter 1.
</p>

<p>
Studying the explicit-control evaluator &#x2014; as well the other virtual
machines we have designed &#x2014; is a great exercise in digesting how
real machines operate, since the language of the controller is very
similar to actual Assembly languages.
</p>

<p>
Here is all the code:
</p>

<div class="org-src-container">
<pre class="src src-scheme">#lang sicp

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">prompt-for-input</span> string)
  (newline) (newline) (display string) (newline))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-global-environment</span>)
  the-global-environment)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">announce-output</span> string)
  (newline) (display string) (newline))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">user-print</span> object)
  (<span style="color: #531ab6;">if</span> (compound-procedure? object)
      (display (list 'compound-procedure
                     (procedure-parameters object)
                     (procedure-body object)
                     '<span style="color: #005f5f;">&lt;procedure-env&gt;</span>))
      (display object)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">variable?</span> exp) (symbol? exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">quoted?</span> exp)
  (tagged-list? exp 'quote))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment?</span> exp)
  (tagged-list? exp 'set!))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition?</span> exp)
  (tagged-list? exp 'define))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if?</span> exp) (tagged-list? exp 'if))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda?</span> exp) (tagged-list? exp 'lambda))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin?</span> exp) (tagged-list? exp 'begin))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">application?</span> exp) (pair? exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">enclosing-environment</span> env) (cdr env))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-empty-environment</span> '())

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-frame</span> env) (car env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">frame-variables</span> frame) (car frame))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">frame-values</span> frame) (cdr frame))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-variable-value</span> var env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (car vals))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">text-of-quotation</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-parameters</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-body</span> exp) (cddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-procedure</span> parameters body env)
  (list 'procedure parameters body env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operands</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operator</span> exp) (car exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-operand</span> ops) (car ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">no-operands?</span> ops) (null? ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-operands</span> ops) (cdr ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure?</span> proc)
  (tagged-list? proc 'primitive))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">compound-procedure?</span> p)
  (tagged-list? p 'procedure))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">apply-in-underlying-scheme</span> apply)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-implementation</span> proc) (cadr proc))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-primitive-procedure</span> proc args)
  (apply-in-underlying-scheme
   (primitive-implementation proc) args))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-parameters</span> p) (cadr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-environment</span> p) (cadddr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-frame</span> variables values)
  (cons variables values))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">extend-environment</span> vars vals base-env)
  (<span style="color: #531ab6;">if</span> (= (length vars) (length vals))
      (cons (make-frame vars vals) base-env)
      (<span style="color: #531ab6;">if</span> (&lt; (length vars) (length vals))
          (error <span style="color: #3548cf;">"Too many arguments supplied"</span> vars vals)
          (error <span style="color: #3548cf;">"Too few arguments supplied"</span> vars vals))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-body</span> p) (caddr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin-actions</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-exp</span> seq) (car seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">last-exp?</span> seq) (null? (cdr seq)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-exps</span> seq) (cdr seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-predicate</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">true?</span> x)
  (not (eq? x false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-alternative</span> exp)
  (<span style="color: #531ab6;">if</span> (not (null? (cdddr exp)))
      (cadddr exp)
      'false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-consequent</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-variable</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-value</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-variable-value!</span> var val env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (set-car! vals val))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable -- SET!"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition-variable</span> exp)
  (<span style="color: #531ab6;">if</span> (symbol? (cadr exp))
      (cadr exp)
      (caadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-lambda</span> parameters body)
  (cons 'lambda (cons parameters body)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition-value</span> exp)
  (<span style="color: #531ab6;">if</span> (symbol? (cadr exp))
      (caddr exp)
      (make-lambda (cdadr exp)   <span style="color: #595959;">; </span><span style="color: #595959;">formal parameters</span>
                   (cddr exp)))) <span style="color: #595959;">; </span><span style="color: #595959;">body</span>

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add-binding-to-frame!</span> var val frame)
  (set-car! frame (cons var (car frame)))
  (set-cdr! frame (cons val (cdr frame))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">define-variable!</span> var val env)
  (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (add-binding-to-frame! var val frame))
            ((eq? var (car vars))
             (set-car! vals val))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (scan (frame-variables frame)
          (frame-values frame))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-machine</span> register-names ops controller-text)
  (<span style="color: #531ab6;">let</span> ((machine (make-new-machine)))
    (<span style="color: #531ab6;">for-each</span> (<span style="color: #531ab6;">lambda</span> (register-name)
                ((machine 'allocate-register) register-name))
              register-names)
    ((machine 'install-operations) ops)
    ((machine 'install-instruction-sequence)
     (assemble controller-text machine))
    machine))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-register</span> name)
  (<span style="color: #531ab6;">let</span> ((contents '*unassigned*))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
      (<span style="color: #531ab6;">cond</span> ((eq? message 'get) contents)
            ((eq? message 'set)
             (<span style="color: #531ab6;">lambda</span> (value) (set! contents value)))
            (<span style="color: #531ab6;">else</span>
             (error <span style="color: #3548cf;">"Unknown request -- REGISTER"</span> message))))
    dispatch))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-contents</span> register)
  (register 'get))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-contents!</span> register value)
  ((register 'set) value))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-stack</span>)
  (<span style="color: #531ab6;">let</span> ((s '()))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push</span> x)
      (set! s (cons x s)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">pop</span>)
      (<span style="color: #531ab6;">if</span> (null? s)
          (error <span style="color: #3548cf;">"Empty stack -- POP"</span>)
          (<span style="color: #531ab6;">let</span> ((top (car s)))
            (set! s (cdr s))
            top)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">initialize</span>)
      (set! s '())
      'done)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
      (<span style="color: #531ab6;">cond</span> ((eq? message 'push) push)
            ((eq? message 'pop) (pop))
            ((eq? message 'initialize) (initialize))
            (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- STACK"</span>
                         message))))
    dispatch))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">pop</span> stack)
  (stack 'pop))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push</span> stack value)
  ((stack 'push) value))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((pc (make-register 'pc))
        (flag (make-register 'flag))
        (stack (make-stack))
        (the-instruction-sequence '()))
    (<span style="color: #531ab6;">let</span> ((the-ops
           (list (list 'initialize-stack
                       (<span style="color: #531ab6;">lambda</span> () (stack 'initialize)))))
          (register-table
           (list (list 'pc pc) (list 'flag flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (assoc name register-table)
            (error <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (set! register-table
                  (cons (list name (make-register name))
                        register-table)))
        'register-allocated)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((val (assoc name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (cadr val)
              (error <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((insts (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (null? insts)
              'done
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (car insts)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((eq? message 'start)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((eq? message 'install-instruction-sequence)
               (<span style="color: #531ab6;">lambda</span> (seq) (set! the-instruction-sequence seq)))
              ((eq? message 'allocate-register) allocate-register)
              ((eq? message 'get-register) lookup-register)
              ((eq? message 'install-operations)
               (<span style="color: #531ab6;">lambda</span> (ops) (set! the-ops (append the-ops ops))))
              ((eq? message 'stack) stack)
              ((eq? message 'operations) the-ops)
              (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">start</span> machine)
  (machine 'start))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-register-contents</span> machine register-name)
  (get-contents (get-register machine register-name)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-register-contents!</span> machine register-name value)
  (set-contents! (get-register machine register-name) value)
  'done)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-register</span> machine reg-name)
  ((machine 'get-register) reg-name))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assemble</span> controller-text machine)
  (<span style="color: #531ab6;">let</span> ((result (extract-labels controller-text)))
    (<span style="color: #531ab6;">let</span> ((insts (car result)) (labels (cdr result)))
      (update-insts! insts labels machine)
      insts)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">extract-labels</span> text)
  (<span style="color: #531ab6;">if</span> (null? text)
      (cons '() '())
      (<span style="color: #531ab6;">let</span> ((result (extract-labels (cdr text))))
        (<span style="color: #531ab6;">let</span> ((insts (car result)) (labels (cdr result)))
          (<span style="color: #531ab6;">let</span> ((next-inst (car text)))
            (<span style="color: #531ab6;">if</span> (symbol? next-inst)
                (cons insts
                      (cons (make-label-entry next-inst insts) labels))
                (cons (cons (make-instruction next-inst) insts)
                      labels)))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">update-insts!</span> insts labels machine)
  (<span style="color: #531ab6;">let</span> ((pc (get-register machine 'pc))
        (flag (get-register machine 'flag))
        (stack (machine 'stack))
        (ops (machine 'operations)))
    (<span style="color: #531ab6;">for-each</span>
     (<span style="color: #531ab6;">lambda</span> (inst)
       (set-instruction-execution-proc!
        inst
        (make-execution-procedure
         (instruction-text inst) labels machine
         pc flag stack ops)))
     insts)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-instruction</span> text)
  (cons text '()))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">instruction-text</span> inst)
  (car inst))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">instruction-execution-proc</span> inst)
  (cdr inst))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-instruction-execution-proc!</span> inst proc)
  (set-cdr! inst proc))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-label-entry</span> label-name insts)
  (cons label-name insts))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-label</span> labels label-name)
  (<span style="color: #531ab6;">let</span> ((val (assoc label-name labels)))
    (<span style="color: #531ab6;">if</span> val
        (cdr val)
        (error <span style="color: #3548cf;">"Undefined label -- ASSEMBLE"</span> label-name))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-execution-procedure</span> inst labels machine
                                  pc flag stack ops)
  (<span style="color: #531ab6;">cond</span> ((eq? (car inst) 'assign)
         (make-assign inst machine labels ops pc))
        ((eq? (car inst) 'test)
         (make-test inst machine labels ops flag pc))
        ((eq? (car inst) 'branch)
         (make-branch inst machine labels flag pc))
        ((eq? (car inst) 'goto)
         (make-goto inst machine labels pc))
        ((eq? (car inst) 'save)
         (make-save inst machine stack pc))
        ((eq? (car inst) 'restore)
         (make-restore inst machine stack pc))
        ((eq? (car inst) 'perform)
         (make-perform inst machine labels ops pc))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown instruction type -- ASSEMBLE"</span>
                     inst))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-assign</span> inst machine labels operations pc)
  (<span style="color: #531ab6;">let</span> ((target
         (get-register machine (assign-reg-name inst)))
        (value-exp (assign-value-exp inst)))
    (<span style="color: #531ab6;">let</span> ((value-proc
           (<span style="color: #531ab6;">if</span> (operation-exp? value-exp)
               (make-operation-exp
                value-exp machine labels operations)
               (make-primitive-exp
                (car value-exp) machine labels))))
      (<span style="color: #531ab6;">lambda</span> ()                <span style="color: #595959;">; </span><span style="color: #595959;">execution procedure for `assign'</span>
        (set-contents! target (value-proc))
        (advance-pc pc)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assign-reg-name</span> assign-instruction)
  (cadr assign-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assign-value-exp</span> assign-instruction)
  (cddr assign-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">advance-pc</span> pc)
  (set-contents! pc (cdr (get-contents pc))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-test</span> inst machine labels operations flag pc)
  (<span style="color: #531ab6;">let</span> ((condition (test-condition inst)))
    (<span style="color: #531ab6;">if</span> (operation-exp? condition)
        (<span style="color: #531ab6;">let</span> ((condition-proc
               (make-operation-exp
                condition machine labels operations)))
          (<span style="color: #531ab6;">lambda</span> ()
            (set-contents! flag (condition-proc))
            (advance-pc pc)))
        (error <span style="color: #3548cf;">"Bad TEST instruction -- ASSEMBLE"</span> inst))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">test-condition</span> test-instruction)
  (cdr test-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-branch</span> inst machine labels flag pc)
  (<span style="color: #531ab6;">let</span> ((dest (branch-dest inst)))
    (<span style="color: #531ab6;">if</span> (label-exp? dest)
        (<span style="color: #531ab6;">let</span> ((insts
               (lookup-label labels (label-exp-label dest))))
          (<span style="color: #531ab6;">lambda</span> ()
            (<span style="color: #531ab6;">if</span> (get-contents flag)
                (set-contents! pc insts)
                (advance-pc pc))))
        (error <span style="color: #3548cf;">"Bad BRANCH instruction -- ASSEMBLE"</span> inst))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">branch-dest</span> branch-instruction)
  (cadr branch-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-goto</span> inst machine labels pc)
  (<span style="color: #531ab6;">let</span> ((dest (goto-dest inst)))
    (<span style="color: #531ab6;">cond</span> ((label-exp? dest)
           (<span style="color: #531ab6;">let</span> ((insts
                  (lookup-label labels
                                (label-exp-label dest))))
             (<span style="color: #531ab6;">lambda</span> () (set-contents! pc insts))))
          ((register-exp? dest)
           (<span style="color: #531ab6;">let</span> ((reg
                  (get-register machine
                                (register-exp-reg dest))))
             (<span style="color: #531ab6;">lambda</span> ()
               (set-contents! pc (get-contents reg)))))
          (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Bad GOTO instruction -- ASSEMBLE"</span>
                       inst)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">goto-dest</span> goto-instruction)
  (cadr goto-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-save</span> inst machine stack pc)
  (<span style="color: #531ab6;">let</span> ((reg (get-register machine
                           (stack-inst-reg-name inst))))
    (<span style="color: #531ab6;">lambda</span> ()
      (push stack (get-contents reg))
      (advance-pc pc))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-restore</span> inst machine stack pc)
  (<span style="color: #531ab6;">let</span> ((reg (get-register machine
                           (stack-inst-reg-name inst))))
    (<span style="color: #531ab6;">lambda</span> ()
      (set-contents! reg (pop stack))
      (advance-pc pc))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stack-inst-reg-name</span> stack-instruction)
  (cadr stack-instruction))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-perform</span> inst machine labels operations pc)
  (<span style="color: #531ab6;">let</span> ((action (perform-action inst)))
    (<span style="color: #531ab6;">if</span> (operation-exp? action)
        (<span style="color: #531ab6;">let</span> ((action-proc
               (make-operation-exp
                action machine labels operations)))
          (<span style="color: #531ab6;">lambda</span> ()
            (action-proc)
            (advance-pc pc)))
        (error <span style="color: #3548cf;">"Bad PERFORM instruction -- ASSEMBLE"</span> inst))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">perform-action</span> inst) (cdr inst))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-primitive-exp</span> exp machine labels)
  (<span style="color: #531ab6;">cond</span> ((constant-exp? exp)
         (<span style="color: #531ab6;">let</span> ((c (constant-exp-value exp)))
           (<span style="color: #531ab6;">lambda</span> () c)))
        ((label-exp? exp)
         (<span style="color: #531ab6;">let</span> ((insts
                (lookup-label labels
                              (label-exp-label exp))))
           (<span style="color: #531ab6;">lambda</span> () insts)))
        ((register-exp? exp)
         (<span style="color: #531ab6;">let</span> ((r (get-register machine
                                (register-exp-reg exp))))
           (<span style="color: #531ab6;">lambda</span> () (get-contents r))))
        (<span style="color: #531ab6;">else</span>
         (error <span style="color: #3548cf;">"Unknown expression type -- ASSEMBLE"</span> exp))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">register-exp?</span> exp) (tagged-list? exp 'reg))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">register-exp-reg</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">constant-exp?</span> exp) (tagged-list? exp 'const))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">constant-exp-value</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">label-exp?</span> exp) (tagged-list? exp 'label))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">label-exp-label</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-operation-exp</span> exp machine labels operations)
  (<span style="color: #531ab6;">let</span> ((op (lookup-prim (operation-exp-op exp) operations))
        (aprocs
         (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (e)
                (make-primitive-exp e machine labels))
              (operation-exp-operands exp))))
    (<span style="color: #531ab6;">lambda</span> ()
      (apply op (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (p) (p)) aprocs)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operation-exp?</span> exp)
  (<span style="color: #531ab6;">and</span> (pair? exp) (tagged-list? (car exp) 'op)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operation-exp-op</span> operation-exp)
  (cadr (car operation-exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operation-exp-operands</span> operation-exp)
  (cdr operation-exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-prim</span> symbol operations)
  (<span style="color: #531ab6;">let</span> ((val (assoc symbol operations)))
    (<span style="color: #531ab6;">if</span> val
        (cadr val)
        (error <span style="color: #3548cf;">"Unknown operation -- ASSEMBLE"</span> symbol))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">self-evaluating?</span> exp)
  (<span style="color: #531ab6;">cond</span> ((number? exp) true)
        ((string? exp) true)
        (<span style="color: #531ab6;">else</span> false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">last-operand?</span> ops)
  (null? (cdr ops)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">empty-arglist</span>) '())

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">adjoin-arg</span> arg arglist)
  (append arglist (list arg)))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">eceval-operations</span>
  (list (list 'self-evaluating? self-evaluating?)
        (list 'empty-arglist empty-arglist)
        (list 'prompt-for-input prompt-for-input)
        (list 'read read)
        (list 'get-global-environment get-global-environment)
        (list 'announce-output announce-output)
        (list 'user-print user-print)
        (list 'variable? variable?)
        (list 'quoted? quoted?)
        (list 'assignment? assignment?)
        (list 'definition? definition?)
        (list 'if? if?)
        (list 'lambda? lambda?)
        (list 'begin? begin?)
        (list 'application? application?)        
        (list 'lookup-variable-value lookup-variable-value)
        (list 'text-of-quotation text-of-quotation)
        (list 'lambda-parameters lambda-parameters)
        (list 'lambda-body lambda-body)
        (list 'make-procedure make-procedure)
        (list 'operands operands)
        (list 'operator operator)
        (list 'first-operand first-operand)
        (list 'no-operands? no-operands?)
        (list 'last-operand? last-operand?)
        (list 'adjoin-arg adjoin-arg)
        (list 'rest-operands rest-operands)
        (list 'primitive-procedure? primitive-procedure?)
        (list 'compound-procedure? compound-procedure?)
        (list 'apply-primitive-procedure apply-primitive-procedure)
        (list 'procedure-parameters procedure-parameters)
        (list 'procedure-environment procedure-environment)
        (list 'extend-environment extend-environment)
        (list 'procedure-body procedure-body)
        (list 'begin-actions begin-actions)
        (list 'first-exp first-exp)
        (list 'last-exp? last-exp?)
        (list 'rest-exps rest-exps)
        (list 'if-predicate if-predicate)
        (list 'true? true?)
        (list 'if-alternative if-alternative)
        (list 'if-consequent if-consequent)
        (list 'assignment-variable assignment-variable)
        (list 'assignment-value assignment-value)
        (list 'set-variable-value! set-variable-value!)
        (list 'definition-variable definition-variable)
        (list 'definition-value definition-value)
        (list 'define-variable! define-variable!)))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">eceval</span>
  (make-machine
   '(exp env val proc argl continue unev)
   eceval-operations
   '(
     read-eval-print-loop
     (perform (op initialize-stack))
     (perform
      (op prompt-for-input) (const <span style="color: #3548cf;">";;; EC-Eval input:"</span>))
     (assign exp (op read))
     (assign env (op get-global-environment))
     (assign continue (label print-result))
     (goto (label eval-dispatch))
     print-result
     (perform
      (op announce-output) (const <span style="color: #3548cf;">";;; EC-Eval value:"</span>))
     (perform (op user-print) (reg val))
     (goto (label read-eval-print-loop))

     unknown-expression-type
     (assign val (const unknown-expression-type-error))
     (goto (label signal-error))

     unknown-procedure-type
     (restore continue)    <span style="color: #595959;">; </span><span style="color: #595959;">clean up stack (from `apply-dispatch')</span>
     (assign val (const unknown-procedure-type-error))
     (goto (label signal-error))

     signal-error
     (perform (op user-print) (reg val))
     (goto (label read-eval-print-loop))

     eval-dispatch
     (test (op self-evaluating?) (reg exp))
     (branch (label ev-self-eval))
     (test (op variable?) (reg exp))
     (branch (label ev-variable))
     (test (op quoted?) (reg exp))
     (branch (label ev-quoted))
     (test (op assignment?) (reg exp))
     (branch (label ev-assignment))
     (test (op definition?) (reg exp))
     (branch (label ev-definition))
     (test (op if?) (reg exp))
     (branch (label ev-if))
     (test (op lambda?) (reg exp))
     (branch (label ev-lambda))
     (test (op begin?) (reg exp))
     (branch (label ev-begin))
     (test (op application?) (reg exp))
     (branch (label ev-application))
     (goto (label unknown-expression-type))

     ev-self-eval
     (assign val (reg exp))
     (goto (reg continue))
     ev-variable
     (assign val (op lookup-variable-value) (reg exp) (reg env))
     (goto (reg continue))
     ev-quoted
     (assign val (op text-of-quotation) (reg exp))
     (goto (reg continue))
     ev-lambda
     (assign unev (op lambda-parameters) (reg exp))
     (assign exp (op lambda-body) (reg exp))
     (assign val (op make-procedure)
             (reg unev) (reg exp) (reg env))
     (goto (reg continue))

     ev-application
     (save continue)
     (save env)
     (assign unev (op operands) (reg exp))
     (save unev)
     (assign exp (op operator) (reg exp))
     (assign continue (label ev-appl-did-operator))
     (goto (label eval-dispatch))

     ev-appl-did-operator
     (restore unev)                  <span style="color: #595959;">; </span><span style="color: #595959;">the operands</span>
     (restore env)
     (assign argl (op empty-arglist))
     (assign proc (reg val))         <span style="color: #595959;">; </span><span style="color: #595959;">the operator</span>
     (test (op no-operands?) (reg unev))
     (branch (label apply-dispatch))
     (save proc)

     ev-appl-operand-loop
     (save argl)
     (assign exp (op first-operand) (reg unev))
     (test (op last-operand?) (reg unev))
     (branch (label ev-appl-last-arg))
     (save env)
     (save unev)
     (assign continue (label ev-appl-accumulate-arg))
     (goto (label eval-dispatch))

     ev-appl-accumulate-arg
     (restore unev)
     (restore env)
     (restore argl)
     (assign argl (op adjoin-arg) (reg val) (reg argl))
     (assign unev (op rest-operands) (reg unev))
     (goto (label ev-appl-operand-loop))

     ev-appl-last-arg
     (assign continue (label ev-appl-accum-last-arg))
     (goto (label eval-dispatch))
     ev-appl-accum-last-arg
     (restore argl)
     (assign argl (op adjoin-arg) (reg val) (reg argl))
     (restore proc)
     (goto (label apply-dispatch))

     apply-dispatch
     (test (op primitive-procedure?) (reg proc))
     (branch (label primitive-apply))
     (test (op compound-procedure?) (reg proc))
     (branch (label compound-apply))
     (goto (label unknown-procedure-type))

     primitive-apply
     (assign val (op apply-primitive-procedure)
             (reg proc)
             (reg argl))
     (restore continue)
     (goto (reg continue))

     compound-apply
     (assign unev (op procedure-parameters) (reg proc))
     (assign env (op procedure-environment) (reg proc))
     (assign env (op extend-environment)
             (reg unev) (reg argl) (reg env))
     (assign unev (op procedure-body) (reg proc))
     (goto (label ev-sequence))


     ev-begin
     (assign unev (op begin-actions) (reg exp))
     (save continue)
     (goto (label ev-sequence))

     ev-sequence
     (assign exp (op first-exp) (reg unev))
     (test (op last-exp?) (reg unev))
     (branch (label ev-sequence-last-exp))
     (save unev)
     (save env)
     (assign continue (label ev-sequence-continue))
     (goto (label eval-dispatch))
     ev-sequence-continue
     (restore env)
     (restore unev)
     (assign unev (op rest-exps) (reg unev))
     (goto (label ev-sequence))
     ev-sequence-last-exp
     (restore continue)
     (goto (label eval-dispatch))
     <span style="color: #595959;">;; </span><span style="color: #595959;">check different implementation in the book</span>


     ev-if
     (save exp)                    <span style="color: #595959;">; </span><span style="color: #595959;">save expression for later</span>
     (save env)
     (save continue)
     (assign continue (label ev-if-decide))
     (assign exp (op if-predicate) (reg exp))
     (goto (label eval-dispatch))  <span style="color: #595959;">; </span><span style="color: #595959;">evaluate the predicate</span>

     ev-if-decide
     (restore continue)
     (restore env)
     (restore exp)
     (test (op true?) (reg val))
     (branch (label ev-if-consequent))

     ev-if-alternative
     (assign exp (op if-alternative) (reg exp))
     (goto (label eval-dispatch))
     ev-if-consequent
     (assign exp (op if-consequent) (reg exp))
     (goto (label eval-dispatch))

     ev-assignment
     (assign unev (op assignment-variable) (reg exp))
     (save unev)                   <span style="color: #595959;">; </span><span style="color: #595959;">save variable for later</span>
     (assign exp (op assignment-value) (reg exp))
     (save env)
     (save continue)
     (assign continue (label ev-assignment-1))
     (goto (label eval-dispatch))  <span style="color: #595959;">; </span><span style="color: #595959;">evaluate the assignment value</span>
     ev-assignment-1
     (restore continue)
     (restore env)
     (restore unev)
     (perform
      (op set-variable-value!) (reg unev) (reg val) (reg env))
     (assign val (const ok))
     (goto (reg continue))

     ev-definition
     (assign unev (op definition-variable) (reg exp))
     (save unev)                   <span style="color: #595959;">; </span><span style="color: #595959;">save variable for later</span>
     (assign exp (op definition-value) (reg exp))
     (save env)
     (save continue)
     (assign continue (label ev-definition-1))
     (goto (label eval-dispatch))  <span style="color: #595959;">; </span><span style="color: #595959;">evaluate the definition value</span>
     ev-definition-1
     (restore continue)
     (restore env)
     (restore unev)
     (perform
      (op define-variable!) (reg unev) (reg val) (reg env))
     (assign val (const ok))
     (goto (reg continue)))))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">primitive-procedures</span>
  (list (list 'car car)
        (list 'cdr cdr)
        (list 'cons cons)
        (list 'null? null?)
        (list '= =)
        (list '+ +)
        (list '- -)
        (list '* *)
        (list '/ /)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure-names</span>)
  (<span style="color: #531ab6;">map</span> car
       primitive-procedures))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure-objects</span>)
  (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (proc) (list 'primitive (cadr proc)))
       primitive-procedures))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">setup-environment</span>)
  (<span style="color: #531ab6;">let</span> ((initial-env
         (extend-environment (primitive-procedure-names)
                             (primitive-procedure-objects)
                             the-empty-environment)))
    (define-variable! 'true true initial-env)
    (define-variable! 'false false initial-env)
    initial-env))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-global-environment</span> (setup-environment))

(start eceval)
</pre>
</div>
