blog/41.html
<div id="outline-container-org438bd28" class="outline-2">
<h2 id="org438bd28">Exercise 5.23</h2>
<div class="outline-text-2" id="text-org438bd28">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Extend the evaluator to handle derived expressions such as `cond',
`let', and so on (section *Note 4-1-2::).  You may "cheat" and assume
that the syntax transformers such as `cond-&gt;if' are available as
machine operations. (fn: This isn't really cheating.  In an actual
implementation built from scratch, we would use our explicit-control
evaluator to interpret a Scheme program that performs source-level
transformations like `cond-&gt;if' in a syntax phase that runs before
execution.)
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
In order to add support for <code>let</code>, I have:
</p>

<ul class="org-ul">
<li><p>
Defined <code>cond?</code> and <code>cond-&gt;if</code>:
</p>
<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond?</span> <span style="color: #8f0075;">exp</span>) (tagged-list? <span style="color: #8f0075;">exp</span> <span style="color: #0000b0;">'cond</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-clauses</span> <span style="color: #8f0075;">exp</span>) (<span style="color: #8f0075;">cdr</span> <span style="color: #8f0075;">exp</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-else-clause?</span> clause)
  (<span style="color: #8f0075;">eq?</span> (cond-predicate clause) <span style="color: #0000b0;">'else</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-predicate</span> clause) (<span style="color: #8f0075;">car</span> clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-actions</span> clause) (<span style="color: #8f0075;">cdr</span> clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-&gt;if</span> <span style="color: #8f0075;">exp</span>)
  (expand-clauses (cond-clauses <span style="color: #8f0075;">exp</span>)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expand-clauses</span> clauses)
  (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> clauses)
      <span style="color: #0000b0;">'false</span>                          <span style="color: #595959;">; </span><span style="color: #595959;">no `else' clause</span>
      (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">first</span> (<span style="color: #8f0075;">car</span> clauses))
            (<span style="color: #005e8b;">rest</span> (<span style="color: #8f0075;">cdr</span> clauses)))
        (<span style="color: #531ab6;">if</span> (cond-else-clause? <span style="color: #8f0075;">first</span>)
            (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> <span style="color: #8f0075;">rest</span>)
                (sequence-&gt;exp (cond-actions <span style="color: #8f0075;">first</span>))
                (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"ELSE clause isn't last -- COND-&gt;IF"</span>
                       clauses))
            (make-if (cond-predicate <span style="color: #8f0075;">first</span>)
                     (sequence-&gt;exp (cond-actions <span style="color: #8f0075;">first</span>))
                     (expand-clauses <span style="color: #8f0075;">rest</span>))))))
</pre>
</div></li>

<li><p>
Added <code>cond?</code> and <code>cond-&gt;if</code> to the <code>eceval-operations</code>:
</p>
<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">eceval-operations</span>
  (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'self-evaluating?</span> self-evaluating?)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'empty-arglist</span> empty-arglist)
        <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond?</span> cond?)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond-&gt;if</span> cond-&gt;if)
        <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'define-variable!</span> define-variable!)))
</pre>
</div></li>

<li><p>
Added a <code>test</code> instruction and a <code>branch</code> instruction to the
<code>eval-dispatch</code> section in the controller text:
</p>
<div class="org-src-container">
<pre class="src src-racket">eval-dispatch
  (test (op self-evaluating?) (reg <span style="color: #8f0075;">exp</span>))
  (branch (label ev-self-eval))
  <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
  (test (op cond?) (reg <span style="color: #8f0075;">exp</span>))
  (branch (label ev-cond))
  <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
  (branch (label ev-application))
  (goto (label unknown-expression-type))
</pre>
</div></li>

<li><p>
Added an <code>ev-cond</code> section in the controller text:
</p>
<div class="org-src-container">
<pre class="src src-racket">ev-sequence
  <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>

ev-cond
  (assign <span style="color: #8f0075;">exp</span> (op cond-&gt;if) (reg <span style="color: #8f0075;">exp</span>))
  (goto (label eval-dispatch))

ev-if
  <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
</pre>
</div></li>
</ul>

<p>
I have done the same, mutatis mutandis, in order to add support for
<code>let</code>:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let?</span> <span style="color: #721045;">exp</span>) (tagged-list? <span style="color: #8f0075;">exp</span> <span style="color: #0000b0;">'let</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-vars</span> <span style="color: #721045;">exp</span>)
  (<span style="color: #8f0075;">map</span> <span style="color: #8f0075;">car</span> (<span style="color: #8f0075;">cadr</span> <span style="color: #8f0075;">exp</span>)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-exps</span> <span style="color: #721045;">exp</span>)
  (<span style="color: #8f0075;">map</span> <span style="color: #8f0075;">cadr</span> (<span style="color: #8f0075;">cadr</span> <span style="color: #8f0075;">exp</span>)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-body</span> <span style="color: #721045;">exp</span>)
  (<span style="color: #8f0075;">cddr</span> <span style="color: #8f0075;">exp</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">named-let-&gt;combination</span> <span style="color: #8f0075;">exp</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">nameless</span> (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">exp</span>) (<span style="color: #8f0075;">cddr</span> <span style="color: #8f0075;">exp</span>)))
        (<span style="color: #005e8b;">name</span> (<span style="color: #8f0075;">cadr</span> <span style="color: #8f0075;">exp</span>)))

    (<span style="color: #8f0075;">cons</span> <span style="color: #0000b0;">'begin</span> (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">cons</span> <span style="color: #0000b0;">'define</span>
                             (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">cons</span> name (let-vars <span style="color: #721045;">nameless</span>))
                                   (let-body <span style="color: #721045;">nameless</span>)))
                       (<span style="color: #8f0075;">cons</span> name (let-exps <span style="color: #721045;">nameless</span>))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-&gt;combination</span> <span style="color: #721045;">exp</span>)
  (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">not</span> (<span style="color: #8f0075;">pair?</span> (<span style="color: #8f0075;">cadr</span> <span style="color: #8f0075;">exp</span>)))
      (named-let-&gt;combination <span style="color: #8f0075;">exp</span>)
      (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">cons</span> <span style="color: #0000b0;">'lambda</span>
                  (<span style="color: #8f0075;">cons</span> (let-vars <span style="color: #721045;">exp</span>)
                        (let-body <span style="color: #721045;">exp</span>)))
            (let-exps <span style="color: #721045;">exp</span>))))

(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">eceval-operations</span>
  (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'self-evaluating?</span> self-evaluating?)
        <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'let?</span> let?)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'let-&gt;combination</span> let-&gt;combination)
        <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'define-variable!</span> define-variable!)))

(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">eceval</span>
  (make-machine
   '(<span style="color: #8f0075;">exp</span> env val proc argl continue unev)
   eceval-operations
   '(
     <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>

     eval-dispatch
       (test (op self-evaluating?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-self-eval))
       (test (op variable?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-variable))
       (test (op quoted?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-quoted))
       (test (op assignment?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-assignment))
       (test (op definition?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-definition))
       (test (op if?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-if))
       (test (op cond?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-cond))
       (test (op let?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-let))
       (test (op lambda?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-lambda))
       (test (op begin?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-begin))
       (test (op application?) (reg <span style="color: #8f0075;">exp</span>))
       (branch (label ev-application))
       (goto (label unknown-expression-type))

     <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>

     ev-let
       (assign <span style="color: #8f0075;">exp</span> (op let-&gt;combination) (reg <span style="color: #8f0075;">exp</span>))
       (goto (label eval-dispatch))

     <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
     )))
</pre>
</div>
</div>
</div>
