blog/41.html
<div id="outline-container-orgddfd3af" class="outline-2">
<h2 id="orgddfd3af">Exercise 5.24</h2>
<div class="outline-text-2" id="text-orgddfd3af">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Implement <code>cond</code> as a new basic special form without reducing it to
<code>if</code>.  You will have to construct a loop that tests the predicates of
successive <code>cond</code> clauses until you find one that is true, and then
use <code>ev-sequence</code> to evaluate the actions of the clause.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I have:
</p>

<ul class="org-ul">
<li><p>
Defined (and added to the machine) some operations:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond?</span> <span style="color: #8f0075;">exp</span>) (tagged-list? <span style="color: #8f0075;">exp</span> <span style="color: #0000b0;">'cond</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-clauses</span> <span style="color: #8f0075;">exp</span>) (<span style="color: #8f0075;">cdr</span> <span style="color: #8f0075;">exp</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-predicate</span> clause) (<span style="color: #8f0075;">car</span> clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-actions</span> clause) (<span style="color: #8f0075;">cdr</span> clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-first-clause</span> clauses)
  (<span style="color: #8f0075;">car</span> clauses))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-rest-clauses</span> clauses)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">eceval-operations</span>
  (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'self-evaluating?</span> self-evaluating?)
        <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond?</span> cond?)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond-clauses</span> cond-clauses)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond-first-clause</span> cond-first-clause)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond-rest-clauses</span> cond-rest-clauses)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond-predicate</span> cond-predicate)
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'cond-actions</span> cond-actions)
        <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
        (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'define-variable!</span> define-variable!)))
</pre>
</div></li>

<li><p>
Updated the controller:
</p>
<div class="org-src-container">
<pre class="src src-racket">ev-cond
  (assign <span style="color: #8f0075;">exp</span> (op cond-clauses) (reg <span style="color: #8f0075;">exp</span>)) <span style="color: #595959;">;; </span><span style="color: #595959;">get rid of cond tag</span>
  (save env) <span style="color: #595959;">;; </span><span style="color: #595959;">FIXME should I save the env in the loop?</span>
  (save continue)
ev-cond-loop
  (save <span style="color: #8f0075;">exp</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">save clauses for later</span>

  <span style="color: #595959;">;; </span><span style="color: #595959;">FIXME should I add a check for the else clause?</span>

  <span style="color: #595959;">;; </span><span style="color: #595959;">FIXME should I add a check for the case in which the clauses are an empty list?</span>

  (assign continue (label ev-cond-decide))
  (assign <span style="color: #8f0075;">exp</span> (op cond-first-clause) (reg <span style="color: #8f0075;">exp</span>)) <span style="color: #595959;">;; </span><span style="color: #595959;">put predicate of first clause</span>
  (assign <span style="color: #8f0075;">exp</span> (op cond-predicate) (reg <span style="color: #8f0075;">exp</span>))    <span style="color: #595959;">;; </span><span style="color: #595959;">in exp</span>
  (goto (label eval-dispatch))

ev-cond-decide
  (restore <span style="color: #8f0075;">exp</span>)
  (test (op true?) (reg val))
  (branch (label ev-cond-actions))
  (assign <span style="color: #8f0075;">exp</span> (op cond-rest-clauses) (reg <span style="color: #8f0075;">exp</span>))
  (goto (label ev-cond-loop))

ev-cond-actions
  (restore continue)
  (restore env)
  (assign unev (op cond-first-clause) (reg <span style="color: #8f0075;">exp</span>)) <span style="color: #595959;">;; </span><span style="color: #595959;">put clause's actions</span>
  (assign unev (op cond-actions) (reg unev))     <span style="color: #595959;">;; </span><span style="color: #595959;">in unev</span>
  (save continue) <span style="color: #595959;">;; </span><span style="color: #595959;">cf. ev-begin...</span>
  (goto (label ev-sequence))
</pre>
</div></li>
</ul>
</div>
</div>
