blog/41.org
** Exercise 5.26
*Exercise*:
#+begin_quote
Use the monitored stack to explore the tail-recursive property of the
evaluator (section 5-4-2).  Start the evaluator and define the
iterative ~factorial~ procedure from section 1.2.1

#+begin_src scheme
  (define (factorial n)
    (define (iter product counter)
      (if (> counter n)
          product
          (iter (* counter product)
                (+ counter 1))))
    (iter 1 1))
#+end_src

Run the procedure with some small values of n.  Record the maximum
stack depth and the number of pushes required to compute n! for
each of these values.

a. You will find that the maximum depth required to evaluate n!  is
independent of n.  What is that depth?

b. Determine from your data a formula in terms of n for the
total number of push operations used in evaluating n! for any
n >= 1.  Note that the number of operations used is a linear
function of n and is thus determined by two constants.
#+end_quote

*Answer*:

#+begin_src racket
  ;;; EC-Eval input:
  (define (factorial n)
    (define (iter product counter)
      (if (> counter n)
          product
          (iter (* counter product)
                (+ counter 1))))
    (iter 1 1))


  (total-pushes = 3 maximum-depth = 3)
  ;;; EC-Eval value:
  ok

  ;;; EC-Eval input:
  (factorial 1)

  (total-pushes = 64 maximum-depth = 10)
  ;;; EC-Eval value:
  1

  ;;; EC-Eval input:
  (factorial 2)

  (total-pushes = 99 maximum-depth = 10)
  ;;; EC-Eval value:
  2

  ;;; EC-Eval input:
  (factorial 3)

  (total-pushes = 134 maximum-depth = 10)
  ;;; EC-Eval value:
  6

  ;;; EC-Eval input:
  (factorial 4)

  (total-pushes = 169 maximum-depth = 10)
  ;;; EC-Eval value:
  24

  ;;; EC-Eval input:
  (factorial 6)

  (total-pushes = 239 maximum-depth = 10)
  ;;; EC-Eval value:
  720

  ;;; EC-Eval input:
  (factorial 9)

  (total-pushes = 344 maximum-depth = 10)
  ;;; EC-Eval value:
  362880

  ;;; EC-Eval input:
  (factorial 12)

  (total-pushes = 449 maximum-depth = 10)
  ;;; EC-Eval value:
  479001600
#+end_src

a: The depth is 10.

b: The difference between the stack operations needed for ~n!~ and
those needed for ~(n+1)!~ is 35.

The linear function can be written in the form ~ops(n!) = a * n + b~,
where ~a~ is the rate at which operations increase (the slope) and ~b~
is the base number of operations.

We know that ~a~ is 35.

By substituting we can find the value of ~b~, which is 29.

So, this should be the formula: ~ops(n!) = 35n + 29~.

