blog/41.html
<div id="outline-container-orgacef6e8" class="outline-2">
<h2 id="orgacef6e8">Exercise 5.26</h2>
<div class="outline-text-2" id="text-orgacef6e8">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Use the monitored stack to explore the tail-recursive property of the
evaluator (section 5-4-2).  Start the evaluator and define the
iterative <code>factorial</code> procedure from section 1.2.1
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">iter</span> product counter)
    (<span style="color: #531ab6;">if</span> (&gt; counter n)
        product
        (iter (* counter product)
              (+ counter 1))))
  (iter 1 1))
</pre>
</div>

<p>
Run the procedure with some small values of n.  Record the maximum
stack depth and the number of pushes required to compute n! for
each of these values.
</p>

<p>
a. You will find that the maximum depth required to evaluate n!  is
independent of n.  What is that depth?
</p>

<p>
b. Determine from your data a formula in terms of n for the
total number of push operations used in evaluating n! for any
n &gt;= 1.  Note that the number of operations used is a linear
function of n and is thus determined by two constants.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">iter</span> product counter)
    (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">&gt;</span> counter n)
        product
        (iter (<span style="color: #8f0075;">*</span> counter product)
              (<span style="color: #8f0075;">+</span> counter <span style="color: #0000b0;">1</span>))))
  (iter <span style="color: #0000b0;">1</span> <span style="color: #0000b0;">1</span>))


(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">1</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">64</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">1</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">2</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">99</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">2</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">3</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">134</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">6</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">4</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">169</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">24</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">6</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">239</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">720</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">9</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">344</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">362880</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">12</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">449</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">10</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">479001600</span>
</pre>
</div>

<p>
a: The depth is 10.
</p>

<p>
b: The difference between the stack operations needed for <code>n!</code> and
those needed for <code>(n+1)!</code> is 35.
</p>

<p>
The linear function can be written in the form <code>ops(n!) = a * n + b</code>,
where <code>a</code> is the rate at which operations increase (the slope) and <code>b</code>
is the base number of operations.
</p>

<p>
We know that <code>a</code> is 35.
</p>

<p>
By substituting we can find the value of <code>b</code>, which is 29.
</p>

<p>
So, this should be the formula: <code>ops(n!) = 35n + 29</code>.
</p>
</div>
</div>
