blog/41.html
<div id="outline-container-org81e7c0e" class="outline-2">
<h2 id="org81e7c0e">Exercise 5.27</h2>
<div class="outline-text-2" id="text-org81e7c0e">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
For comparison with exercise 5.26, explore the behavior of the
following procedure for computing factorials recursively:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">if</span> (= n 1)
      1
      (* (factorial (- n 1)) n)))
</pre>
</div>

<p>
By running this procedure with the monitored stack, determine, as
a function of n, the maximum depth of the stack and the total
number of pushes used in evaluating n! for n &gt;= 1.  (Again, these
functions will be linear.)  Summarize your experiments by filling
in the following table with the appropriate expressions in terms
of n:
</p>

<p>
Maximum depth       Number of pushes
</p>

<p>
Recursive
factorial
</p>

<p>
Iterative
factorial
</p>

<p>
The maximum depth is a measure of the amount of space used by the
evaluator in carrying out the computation, and the number of pushes
correlates well with the time required.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #595959;">;; </span><span style="color: #595959;">monitoring the recursive factorial</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">=</span> n <span style="color: #0000b0;">1</span>)
      <span style="color: #0000b0;">1</span>
      (<span style="color: #8f0075;">*</span> (factorial (<span style="color: #8f0075;">-</span> n <span style="color: #0000b0;">1</span>)) n)))

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">1</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">16</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">8</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">1</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">2</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">48</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">13</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">2</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">3</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">80</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">18</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">6</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">4</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">112</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">23</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">24</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">5</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">144</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">28</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">120</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">6</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">176</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">33</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">720</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">7</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">208</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">38</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">5040</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">8</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">240</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">43</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">40320</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">9</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">272</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">48</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">362880</span>
</pre>
</div>

<ul class="org-ul">
<li>recursive factorial:
<ul class="org-ul">
<li>number of pushes:
<ul class="org-ul">
<li><code>ops(n!) = 32 * n + 16</code></li>
</ul></li>
<li>Max depth:
<ul class="org-ul">
<li><code>max_depth(n!) = 5 * n + 3</code></li>
</ul></li>
</ul></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Maximum depth</th>
<th scope="col" class="org-left">Number of pushes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">recursive</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">w</td>
</tr>

<tr>
<td class="org-left">factorial</td>
<td class="org-left">5 * n + 3</td>
<td class="org-left">32 * n + 16</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Iterative</td>
<td class="org-left">10</td>
<td class="org-left">35 * n + 29</td>
</tr>

<tr>
<td class="org-left">factorial</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
