blog/41.org
** Exercise 5.28
*Exercise*:

#+begin_quote
Modify the definition of the evaluator by changing ~eval-sequence~ as
described in section 5.4.2 so that the evaluator is no longer
tail-recursive.  Rerun your experiments from Exercise 5.26 and
Exercise 5.27 to demonstrate that both versions of the ~factorial~
procedure now require space that grows linearly with their input.
#+end_quote

*Answer*:

#+begin_src racket
  ;;; EC-Eval input:
  (define (factorial n)
    (define (iter product counter)
      (if (> counter n)
          product
          (iter (* counter product)
                (+ counter 1))))
    (iter 1 1))


  (total-pushes = 3 maximum-depth = 3)
  ;;; EC-Eval value:
  ok

  ;;; EC-Eval input:
  (factorial 1)

  (total-pushes = 70 maximum-depth = 17)
  ;;; EC-Eval value:
  1

  ;;; EC-Eval input:
  (factorial 2)

  (total-pushes = 107 maximum-depth = 20)
  ;;; EC-Eval value:
  2

  ;;; EC-Eval input:
  (factorial 3)

  (total-pushes = 144 maximum-depth = 23)
  ;;; EC-Eval value:
  6

  ;;; EC-Eval input:
  (factorial 4)

  (total-pushes = 181 maximum-depth = 26)
  ;;; EC-Eval value:
  24

  ;;; EC-Eval input:
  (factorial 5)

  (total-pushes = 218 maximum-depth = 29)
  ;;; EC-Eval value:
  120

  ;;; EC-Eval input:
  (factorial 6)

  (total-pushes = 255 maximum-depth = 32)
  ;;; EC-Eval value:
  720
#+end_src

#+begin_src racket
  ;;; EC-Eval input:
  (define (factorial n)
    (if (= n 1)
        1
        (* (factorial (- n 1)) n)))

  (total-pushes = 3 maximum-depth = 3)
  ;;; EC-Eval value:
  ok

  ;;; EC-Eval input:
  (factorial 1
             )

  (total-pushes = 18 maximum-depth = 11)
  ;;; EC-Eval value:
  1

  ;;; EC-Eval input:
  (factorial 2)

  (total-pushes = 52 maximum-depth = 19)
  ;;; EC-Eval value:
  2

  ;;; EC-Eval input:
  (factorial 3)

  (total-pushes = 86 maximum-depth = 27)
  ;;; EC-Eval value:
  6

  ;;; EC-Eval input:
  (factorial 4)

  (total-pushes = 120 maximum-depth = 35)
  ;;; EC-Eval value:
  24

  ;;; EC-Eval input:
  (factorial 5)

  (total-pushes = 154 maximum-depth = 43)
  ;;; EC-Eval value:
  120

  ;;; EC-Eval input:
  (factorial 6)

  (total-pushes = 188 maximum-depth = 51)
  ;;; EC-Eval value:
  720
#+end_src

