blog/41.html
<div id="outline-container-orgb696cca" class="outline-2">
<h2 id="orgb696cca">Exercise 5.28</h2>
<div class="outline-text-2" id="text-orgb696cca">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Modify the definition of the evaluator by changing <code>eval-sequence</code> as
described in section 5.4.2 so that the evaluator is no longer
tail-recursive.  Rerun your experiments from Exercise 5.26 and
Exercise 5.27 to demonstrate that both versions of the <code>factorial</code>
procedure now require space that grows linearly with their input.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">iter</span> product counter)
    (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">&gt;</span> counter n)
        product
        (iter (<span style="color: #8f0075;">*</span> counter product)
              (<span style="color: #8f0075;">+</span> counter <span style="color: #0000b0;">1</span>))))
  (iter <span style="color: #0000b0;">1</span> <span style="color: #0000b0;">1</span>))


(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">1</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">70</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">17</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">1</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">2</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">107</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">20</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">2</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">3</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">144</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">23</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">6</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">4</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">181</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">26</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">24</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">5</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">218</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">29</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">120</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">6</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">255</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">32</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">720</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">=</span> n <span style="color: #0000b0;">1</span>)
      <span style="color: #0000b0;">1</span>
      (<span style="color: #8f0075;">*</span> (factorial (<span style="color: #8f0075;">-</span> n <span style="color: #0000b0;">1</span>)) n)))

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">1</span>
           )

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">18</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">11</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">1</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">2</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">52</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">19</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">2</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">3</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">86</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">27</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">6</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">4</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">120</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">35</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">24</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">5</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">154</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">43</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">120</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(factorial <span style="color: #0000b0;">6</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">188</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">51</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">720</span>
</pre>
</div>
</div>
</div>
