blog/41.org
** Exercise 5.29
*Exercise*:

#+begin_quote
Monitor the stack operations in the tree-recursive Fibonacci
computation:

#+begin_src scheme
  (define (fib n)
    (if (< n 2)
        n
        (+ (fib (- n 1)) (fib (- n 2)))))
#+end_src

a. Give a formula in terms of ~n~ for the maximum depth of the stack
required to compute ~Fib(n)~ for ~n >= 2~.  Hint: In section 2.2 we
argued that the space used by this process grows linearly with ~n~.

b. Give a formula for the total number of pushes used to compute
~Fib(n)~ for ~n >= 2~.  You should find that the number of pushes
(which correlates well with the time used) grows exponentially with
~n~.  Hint: Let ~S(n)~ be the number of pushes used in computing
~Fib(n)~.  You should be able to argue that there is a formula that
expresses ~S(n)~ in terms of ~S(n - 1)~, ~S(n - 2)~, and some fixed
"overhead" constant k that is independent of n.  Give the formula, and
say what ~k~ is.  Then show that ~S(n)~ can be expressed as
~aFib(n + 1) + b~ and give the values of ~a~ and ~b~.
#+end_quote

*Answer*:

#+begin_src racket
  ;;; EC-Eval input:
  (define (fib n)
    (if (< n 2)
        n
        (+ (fib (- n 1)) (fib (- n 2)))))

  (total-pushes = 3 maximum-depth = 3)
  ;;; EC-Eval value:
  ok

  ;;; EC-Eval input:
  (fib 2)

  (total-pushes = 72 maximum-depth = 13)
  ;;; EC-Eval value:
  1

  ;;; EC-Eval input:
  (fib 3)

  (total-pushes = 128 maximum-depth = 18)
  ;;; EC-Eval value:
  2

  ;;; EC-Eval input:
  (fib 4)

  (total-pushes = 240 maximum-depth = 23)
  ;;; EC-Eval value:
  3

  ;;; EC-Eval input:
  (fib 5)

  (total-pushes = 408 maximum-depth = 28)
  ;;; EC-Eval value:
  5

  ;;; EC-Eval input:
  (fib 6)

  (total-pushes = 688 maximum-depth = 33)
  ;;; EC-Eval value:
  8

  ;;; EC-Eval input:
  (fib 7)

  (total-pushes = 1136 maximum-depth = 38)
  ;;; EC-Eval value:
  13

  ;;; EC-Eval input:
  (fib 8)

  (total-pushes = 1864 maximum-depth = 43)
  ;;; EC-Eval value:
  21

  ;;; EC-Eval input:
  (fib 9)

  (total-pushes = 3040 maximum-depth = 48)
  ;;; EC-Eval value:
  34

  ;;; EC-Eval input:
  (fib 10)
#+end_src


- a.

  ~max-depth(fib(n)) = 5n + 8~.

- b.

  The first formula is ~S(n) = S(n-1) + S(n-2) + 40~.

  The second one...?
