blog/41.html
<div id="outline-container-orgb9ff239" class="outline-2">
<h2 id="orgb9ff239">Exercise 5.29</h2>
<div class="outline-text-2" id="text-orgb9ff239">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Monitor the stack operations in the tree-recursive Fibonacci
computation:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fib</span> n)
  (<span style="color: #531ab6;">if</span> (&lt; n 2)
      n
      (+ (fib (- n 1)) (fib (- n 2)))))
</pre>
</div>

<p>
a. Give a formula in terms of <code>n</code> for the maximum depth of the stack
required to compute <code>Fib(n)</code> for <code>n &gt;= 2</code>.  Hint: In section 2.2 we
argued that the space used by this process grows linearly with <code>n</code>.
</p>

<p>
b. Give a formula for the total number of pushes used to compute
<code>Fib(n)</code> for <code>n &gt;= 2</code>.  You should find that the number of pushes
(which correlates well with the time used) grows exponentially with
<code>n</code>.  Hint: Let <code>S(n)</code> be the number of pushes used in computing
<code>Fib(n)</code>.  You should be able to argue that there is a formula that
expresses <code>S(n)</code> in terms of <code>S(n - 1)</code>, <code>S(n - 2)</code>, and some fixed
"overhead" constant k that is independent of n.  Give the formula, and
say what <code>k</code> is.  Then show that <code>S(n)</code> can be expressed as
<code>aFib(n + 1) + b</code> and give the values of <code>a</code> and <code>b</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fib</span> n)
  (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">&lt;</span> n <span style="color: #0000b0;">2</span>)
      n
      (<span style="color: #8f0075;">+</span> (fib (<span style="color: #8f0075;">-</span> n <span style="color: #0000b0;">1</span>)) (fib (<span style="color: #8f0075;">-</span> n <span style="color: #0000b0;">2</span>)))))

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">2</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">72</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">13</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">1</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">3</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">128</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">18</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">2</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">4</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">240</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">23</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">3</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">5</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">408</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">28</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">5</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">6</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">688</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">33</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">8</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">7</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">1136</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">38</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">13</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">8</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">1864</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">43</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">21</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">9</span>)

(total-pushes <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">3040</span> maximum-depth <span style="color: #8f0075;">=</span> <span style="color: #0000b0;">48</span>)
<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval value:</span>
<span style="color: #0000b0;">34</span>

<span style="color: #595959;">;;; </span><span style="color: #595959;">EC-Eval input:</span>
(fib <span style="color: #0000b0;">10</span>)
</pre>
</div>


<ul class="org-ul">
<li><p>
a.
</p>

<p>
<code>max-depth(fib(n)) = 5n + 8</code>.
</p></li>

<li><p>
b.
</p>

<p>
The first formula is <code>S(n) = S(n-1) + S(n-2) + 40</code>.
</p>

<p>
The second one&#x2026;?
</p></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html"></a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span></p>
</div>
</body>
</html>
